backend: tensorflow
class_name: Sequential
config:
  layers:
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      batch_input_shape: !!python/tuple
      - null
      - 50
      - 50
      - 1
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 5
      - 5
      name: conv2d
      padding: valid
      strides: &id002 !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: true
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation
      trainable: true
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout
      noise_shape: null
      rate: 0.01
      seed: null
      trainable: true
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 5
      - 5
      name: conv2d_1
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_1
      trainable: true
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_1
      noise_shape: null
      rate: 0.01
      seed: null
      trainable: true
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 5
      - 5
      name: conv2d_2
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_2
      trainable: true
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_2
      noise_shape: null
      rate: 0.01
      seed: null
      trainable: true
  - class_name: Flatten
    config:
      data_format: channels_last
      dtype: float32
      name: flatten
      trainable: true
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense
      trainable: true
      units: 2
      use_bias: true
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_3
      trainable: true
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 128
      use_bias: true
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_4
      trainable: true
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_2
      trainable: true
      units: 13
      use_bias: true
  - class_name: Activation
    config:
      activation: softmax
      dtype: float32
      name: activation_5
      trainable: true
  name: sequential
keras_version: 2.2.4-tf
